clc
clear
%自定义龙格库塔法求解

x=[0 : 0.001 :20];                    % x——行向量
h=0.001;
n=4;                                
y=zeros(length(x) , n);		        % y——矩阵，行数是x的元素个数，列数是几阶微分方程
                                    % 后面的1表示一阶微分方程,如果是2则表示二阶微分方程，以此类推
y(1,:)=[-254.01 300 83 0];
                                    % y(1,:)=[1 1 5 1 1 1 1 1 1 1 1 1 1 1]; 
len = length(x);	
% an=@(t,y)[y(3);y(4);-2*y(3)-y(1);-2*y(4)-y(2)];%磁机械的

for i=2:len		%循环：直到求完最后一个x取值

K1 = my2(x(i-1),y(i-1,:));  		% K1

K2 = my2(x(i-1)+1/2*h , y(i-1,:)+1/2*h.*K1);		% K2

K3 = my2(x(i-1)+1/2*h , y(i-1,:)+1/2*h.*K2);		% K3

K4 = my2(x(i-1)+h , y(i-1,:)+h.*K3);			% K4


y(i,:) = y(i-1,:)+h/6.*(K1 + 2*K2 + 2*K3 + K4);           % 更新y的第i行，y(i,1)是原函数的y，y(i,2)是原函数的一阶导，以此类推
														  % 因为这里是1阶微分方程，所以只有y(i,1)，无y(i,2)
end

%% 绘图
plot(y(:,1),y(:,2),'linewidth',2)
title('轨迹图');
xlabel('X坐标');
ylabel('Y坐标');
set(gca,'Fontsize',14)                %设置字体大小为14
set(gca,'FontWeight','bold')          %字体加粗
hold on
plot([0,800],[0,0])
X=y(:,1);
Y=y(:,2);
N=find(abs(Y)<0.01)
X(N)
%%  函数
function dy=my2(x,y)
m=50;                                   %物体质量
g=9.8;                                  %重力加速度
K=0.5;
dy=zeros(size(y));
dy(1)=y(3);
dy(2)=y(4);
dy(3)=-K/m*((y(3)-5))*sqrt(((y(3)-5))^2+y(4)^2);
dy(4)=-g-K/m*sqrt(((y(3)-5))^2+y(4)^2)*y(4);
end